app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('コメントです', 1, 4, '2025-08-26 03:47:20.979267', '2025-08-26 03:47:20.979267')
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 4
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 4 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save
      redirect_to prototype_path(@comment.prototype)
    else
      @prototype = @comment.prototype || Prototype.find(params[:prototype_id])
      @comments  = @prototype.comments.includes(:user)