app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.includes(:user).with_attached_image.order(created_at: :desc)
---
SELECT `prototypes`.* FROM `prototypes` ORDER BY `prototypes`.`created_at` DESC

  def create
    @prototype = current_user.prototypes.build(prototype_params)

    if @prototype.save
---
INSERT INTO `prototypes` (`created_at`, `updated_at`, `title`, `catch_copy`, `concept`, `user_id`) VALUES ('2025-08-19 02:51:47.759722', '2025-08-19 02:51:47.759722', 'プロトタイプ１', 'aaaa', 'aaaa', 1)

  def show
  @prototype = Prototype.find(params[:id])
  @comment   = Comment.new
  @comments  = @prototype.comments.includes(:user).order(created_at: :asc)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 4 ORDER BY `comments`.`created_at` ASC

  def edit
  @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 4 LIMIT 1

  def update
    if @prototype.update(prototype_params)
---
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2025-08-19 06:53:40.274958', `prototypes`.`title` = 'プロトタイプ１ー編集後' WHERE `prototypes`.`id` = 2

  def destroy
    @prototype = Prototype.find(params[:id])
    @prototype.destroy
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 2

  def set_prototype
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1